airgrzybek/FreeRTOS/FreeRTOS/FreeRTOS-Plus-IO/Device/STM32F10x/FreeRTOS_stm32f10x_usart.c
                    }
                    #endif /* ioconfigUSE_UART_TX_CHAR_QUEUE */
                    break;


                default :

                    /* Other methods can be implemented here.  For now set the
                    stored transfer structure back to NULL as nothing is being
                    sent. */
                    configASSERT( xReturn );
                    pxTxTransferControlStructs[ cPeripheralNumber ] = NULL;

                    /* Prevent compiler warnings when the configuration is set such
                    that the following parameters are not used. */
                    ( void ) pvBuffer;
                    ( void ) xBytes;
                    ( void ) USARTx;
                    break;
            }
        }

        return xReturn;
}

size_t FreeRTOS_UART_read( Peripheral_Descriptor_t const pxPeripheral, void * const pvBuffer, const size_t xBytes )
{
    Peripheral_Control_t * const pxPeripheralControl =
            (Peripheral_Control_t * const ) pxPeripheral;
    size_t xReturn = 0U;
    size_t rChar = 0;
    USART_TypeDef * USARTx = (USART_TypeDef *)diGET_PERIPHERAL_BASE_ADDRESS(pxPeripheralControl);

    if( diGET_RX_TRANSFER_STRUCT( pxPeripheralControl ) == NULL )
    {
        #if ioconfigUSE_UART_POLLED_RX == 1
        {
            xReturn = USART_ReceiveBuffer(USARTx,(uint8_t*)pvBuffer,xBytes);
        }
        #endif /* ioconfigUSE_UART_POLLED_RX */
    }
    else
    {
        /* Sanity check the array index. */
        configASSERT( diGET_PERIPHERAL_NUMBER( pxPeripheralControl ) < ( int8_t ) ( sizeof( xIRQ ) / sizeof( IRQn_Type ) ) );

        switch( diGET_RX_TRANSFER_TYPE( pxPeripheralControl ) )
        {
            case ioctlUSE_CIRCULAR_BUFFER_RX :

                #if ioconfigUSE_UART_CIRCULAR_BUFFER_RX == 1
                {
                    /* There is nothing to prevent multiple tasks attempting to
                    read the circular buffer at any one time.  The implementation
                    of the circular buffer uses a semaphore to indicate when new
                    data is available, and the semaphore will ensure that only the
                    highest priority task that is attempting a read will actually
                    receive bytes. */
                    ioutilsRECEIVE_CHARS_FROM_CIRCULAR_BUFFER
                        (
                            pxPeripheralControl,
                            USART_ITConfig( USARTx, USART_IT_RXNE, DISABLE ), /* Disable peripheral. */
                            USART_ITConfig( USARTx, USART_IT_RXNE, ENABLE ),  /* Enable peripheral. */
                            ( ( uint8_t * ) pvBuffer ),                         /* Data destination. */
                            xBytes,                                             /* Bytes to read. */
                            xReturn                                             /* Number of bytes read. */
                        );
                }
                #endif /* ioconfigUSE_UART_CIRCULAR_BUFFER_RX */
                break;


            case ioctlUSE_CHARACTER_QUEUE_RX :

                #if ioconfigUSE_UART_RX_CHAR_QUEUE == 1
                {
                    /* The queue allows multiple tasks to attempt to read
                    bytes, but ensures only the highest priority of these
                    tasks will actually receive bytes.  If two tasks of equal
                    priority attempt to read simultaneously, then the
                    application must ensure mutual exclusion, as time slicing
                    could result in the string being received being partially
                    received by each task. */
                    xReturn = xIOUtilsReceiveCharsFromRxQueue( pxPeripheralControl,
                                ( uint8_t * ) pvBuffer, xBytes );
                }
                #endif /* ioconfigUSE_UART_RX_CHAR_QUEUE */
                break;


            default :

                /* Other methods can be implemented here. */
                configASSERT( xReturn );

                /* Prevent compiler warnings when the configuration is set such
                that the following parameters are not used. */
                ( void ) pvBuffer;
                ( void ) xBytes;
                ( void ) USARTx;
                break;
        }
    }

    return xReturn;
}

portBASE_TYPE FreeRTOS_UART_ioctl( Peripheral_Descriptor_t pxPeripheral, uint32_t ulRequest, void *pvValue )
{
    Peripheral_Control_t * const pxPeripheralControl =
            (Peripheral_Control_t * const ) pxPeripheral;
    uint32_t ulValue = (uint32_t) pvValue;
    const int8_t cPeripheralNumber =
            diGET_PERIPHERAL_NUMBER( ( ( Peripheral_Control_t * const ) pxPeripheral ) );
    USART_TypeDef * USARTx = (USART_TypeDef *)diGET_PERIPHERAL_BASE_ADDRESS(pxPeripheralControl);
    portBASE_TYPE xReturn = pdPASS;
    NVIC_InitTypeDef NVIC_InitStructure;
    USART_ClockInitTypeDef USART_InitClockStructure;
    USART_InitTypeDef USART_InitStructure;

    /* Sanity check the array index. */
    configASSERT( cPeripheralNumber < ( int8_t ) ( sizeof( xIRQ ) / sizeof( IRQn_Type ) ) );

    taskENTER_CRITICAL();
    {
        switch (ulRequest)
        {
        case ioctlUSE_INTERRUPTS:

            if (ulValue == pdFALSE)
            {
                NVIC_DisableIRQ(xIRQ[cPeripheralNumber]);
            }
            else
            {
                /* Enable the Rx and Tx interrupt. */
                USART_ITConfig( USARTx, USART_IT_RXNE, ENABLE );
                //USART_ITConfig( USART1, USART_IT_TXE, ENABLE );

                NVIC_InitStructure.NVIC_IRQChannel = xIRQ[cPeripheralNumber-1];
                NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority =
                        configLIBRARY_KERNEL_INTERRUPT_PRIORITY;
                NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
                NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
                NVIC_Init(&NVIC_InitStructure);

                /* If the Rx is configured to use interrupts, remember the
                 transfer control structure that should be used.  A reference
                 to the Tx transfer control structure is taken when a write()
                 operation is actually performed. */
                pxRxTransferControlStructs[cPeripheralNumber] =
                        pxPeripheralControl->pxRxControl;
            }
            break;

