airgrzybek/FreeRTOS/FreeRTOS/FreeRTOS-Plus-IO/Device/STM32F10x/FreeRTOS_stm32f10x_usart.c
        case ioctlSET_SPEED:

            /* Set up the default UART configuration. */
            USART_InitStructure.USART_BaudRate = ulValue;
            USART_InitStructure.USART_WordLength = USART_WordLength_8b;
            USART_InitStructure.USART_StopBits = USART_StopBits_1;
            USART_InitStructure.USART_Parity = USART_Parity_No ;
            USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
            USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
            USART_InitClockStructure.USART_Clock = USART_Clock_Disable;
            USART_InitClockStructure.USART_CPOL = USART_CPOL_Low;
            USART_InitClockStructure.USART_CPHA = USART_CPHA_2Edge;
            USART_InitClockStructure.USART_LastBit = USART_LastBit_Disable;
            USART_ClockInit( USARTx, &USART_InitClockStructure);
            break;

        case ioctlSET_INTERRUPT_PRIORITY:

            /* The ISR uses ISR safe FreeRTOS API functions, so the priority
             being set must be lower than (ie numerically larger than)
             configMAX_LIBRARY_INTERRUPT_PRIORITY. */
            configASSERT( ulValue >= configMAX_LIBRARY_INTERRUPT_PRIORITY );
            //NVIC_SetPriority(xIRQ[cPeripheralNumber], ulValue);

            NVIC_InitStructure.NVIC_IRQChannel = xIRQ[cPeripheralNumber-1];
            NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = ulValue;
            NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
            NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
            NVIC_Init(&NVIC_InitStructure);
            break;

        default:

            xReturn = pdFAIL;
            break;
        }
    }
    taskEXIT_CRITICAL();

    return xReturn;
}

//(USART_GetFlagStatus( USART1, USART_FLAG_RXNE ) == RESET)
void USART1_IRQHandler(void)
{
    uint32_t ulInterruptSource, ulReceived;
    const uint32_t ulRxInterrupts = USART_IT_RXNE;
    portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
    const unsigned portBASE_TYPE uxUARTNumber = 1UL;
    Transfer_Control_t *pxTransferStruct;

    /* Determine the interrupt source. */

    if(USART_GetITStatus(USART1,USART_IT_RXNE) == SET)
    {
        pxTransferStruct = pxRxTransferControlStructs[ uxUARTNumber ];
        if( pxTransferStruct != NULL )
        {
            switch( diGET_TRANSFER_TYPE_FROM_CONTROL_STRUCT( pxTransferStruct ) )
            {
                case ioctlUSE_CIRCULAR_BUFFER_RX :

#if ioconfigUSE_UART_CIRCULAR_BUFFER_RX == 1
                {
                    ioutilsRX_CHARS_INTO_CIRCULAR_BUFFER_FROM_ISR(
                            pxTransferStruct, /* The structure that contains the reference to the circular buffer. */
                            (USART_GetFlagStatus(USART1,USART_FLAG_RXNE) == SET), /* While loop condition. */
                            (USART1->DR), /* Register holding the received character. */
                            ulReceived,
                            xHigherPriorityTaskWoken
                    );
                }
#endif /* ioconfigUSE_UART_CIRCULAR_BUFFER_RX */
                break;

                case ioctlUSE_CHARACTER_QUEUE_RX :

#if ioconfigUSE_UART_RX_CHAR_QUEUE == 1
                {
                    ioutilsRX_CHARS_INTO_QUEUE_FROM_ISR( pxTransferStruct,
                            (USART_GetFlagStatus(USART1,USART_FLAG_RXNE) == SET),
                            (USART1->DR), ulReceived, xHigherPriorityTaskWoken );
                }
#endif /* ioconfigUSE_UART_RX_CHAR_QUEUE */
                break;

                default :

                /* This must be an error.  Force an assert. */
                configASSERT( xHigherPriorityTaskWoken );
                break;
            }
        }
    }

    if(USART_GetITStatus(USART1,USART_IT_TXE) == SET)
    {
        /* The transmit holding register is empty.  Is there any more data
         to send? */
        pxTransferStruct = pxTxTransferControlStructs[ uxUARTNumber ];
        if( pxTransferStruct != NULL )
        {
            switch( diGET_TRANSFER_TYPE_FROM_CONTROL_STRUCT( pxTransferStruct ) )
            {
                case ioctlUSE_ZERO_COPY_TX:

#if ioconfigUSE_UART_ZERO_COPY_TX == 1
                {
                    iouitlsTX_CHARS_FROM_ZERO_COPY_BUFFER_FROM_ISR( pxTransferStruct, ( ( LPC_UART3->FIFOLVL & uartTX_FIFO_LEVEL_MASK ) != uartTX_FIFO_LEVEL_MASK ), ( LPC_UART3->THR = ucChar ), xHigherPriorityTaskWoken );
                }
#endif /* ioconfigUSE_UART_ZERO_COPY_TX */
                break;

                case ioctlUSE_CHARACTER_QUEUE_TX:

#if ioconfigUSE_UART_TX_CHAR_QUEUE == 1
                {
                    ioutilsTX_CHARS_FROM_QUEUE_FROM_ISR( pxTransferStruct,
                            (USART_GetFlagStatus(USART1,USART_FLAG_TXE) == SET),
                            ( USART1->DR = ucChar), xHigherPriorityTaskWoken );
                    USART_ITConfig( USART1, USART_IT_TXE, DISABLE );
                }
#endif /* ioconfigUSE_UART_TX_CHAR_QUEUE */
                break;

                default :

                /* This must be an error.  Force an assert. */
                configASSERT( xHigherPriorityTaskWoken );
                break;
            }
        }
    }

    /* The ulReceived parameter is not used by the UART ISR. */
    ( void ) ulReceived;

    /* If lHigherPriorityTaskWoken is now equal to pdTRUE, then a context
     switch should be performed before the interrupt exists.  That ensures the
     unblocked (higher priority) task is returned to immediately. */
    portEND_SWITCHING_ISR( xHigherPriorityTaskWoken );
}


void USART2_IRQHandler(void)
{
    uint32_t ulInterruptSource, ulReceived;
    const uint32_t ulRxInterrupts = USART_IT_RXNE;
    portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
    const unsigned portBASE_TYPE uxUARTNumber = 1UL;
    Transfer_Control_t *pxTransferStruct;

    /* Determine the interrupt source. */

    if(USART_GetITStatus(USART2,USART_IT_RXNE) == SET)
    {
        pxTransferStruct = pxRxTransferControlStructs[ uxUARTNumber ];
        if( pxTransferStruct != NULL )
        {
            switch( diGET_TRANSFER_TYPE_FROM_CONTROL_STRUCT( pxTransferStruct ) )
            {
                case ioctlUSE_CIRCULAR_BUFFER_RX :

