airgrzybek/FreeRTOS/FreeRTOS/FreeRTOS-Plus-IO/Device/STM32F10x/FreeRTOS_stm32f10x_usart.c
#if ioconfigUSE_UART_CIRCULAR_BUFFER_RX == 1
                {
                    ioutilsRX_CHARS_INTO_CIRCULAR_BUFFER_FROM_ISR(
                            pxTransferStruct, /* The structure that contains the reference to the circular buffer. */
                            (USART_GetFlagStatus(USART2,USART_FLAG_RXNE) == SET), /* While loop condition. */
                            (USART2->DR), /* Register holding the received character. */
                            ulReceived,
                            xHigherPriorityTaskWoken
                    );
                }
#endif /* ioconfigUSE_UART_CIRCULAR_BUFFER_RX */
                break;

                case ioctlUSE_CHARACTER_QUEUE_RX :

#if ioconfigUSE_UART_RX_CHAR_QUEUE == 1
                {
                    ioutilsRX_CHARS_INTO_QUEUE_FROM_ISR( pxTransferStruct,
                            (USART_GetFlagStatus(USART2,USART_FLAG_RXNE) == SET),
                            (USART2->DR), ulReceived, xHigherPriorityTaskWoken );
                }
#endif /* ioconfigUSE_UART_RX_CHAR_QUEUE */
                break;

                default :

                /* This must be an error.  Force an assert. */
                configASSERT( xHigherPriorityTaskWoken );
                break;
            }
        }
    }

    if(USART_GetITStatus(USART2,USART_IT_TXE) == SET)
    {
        /* The transmit holding register is empty.  Is there any more data
         to send? */
        pxTransferStruct = pxTxTransferControlStructs[ uxUARTNumber ];
        if( pxTransferStruct != NULL )
        {
            switch( diGET_TRANSFER_TYPE_FROM_CONTROL_STRUCT( pxTransferStruct ) )
            {
                case ioctlUSE_ZERO_COPY_TX:

#if ioconfigUSE_UART_ZERO_COPY_TX == 1
                {
                    iouitlsTX_CHARS_FROM_ZERO_COPY_BUFFER_FROM_ISR( pxTransferStruct, ( ( LPC_UART3->FIFOLVL & uartTX_FIFO_LEVEL_MASK ) != uartTX_FIFO_LEVEL_MASK ), ( LPC_UART3->THR = ucChar ), xHigherPriorityTaskWoken );
                }
#endif /* ioconfigUSE_UART_ZERO_COPY_TX */
                break;

                case ioctlUSE_CHARACTER_QUEUE_TX:

#if ioconfigUSE_UART_TX_CHAR_QUEUE == 1
                {
                    ioutilsTX_CHARS_FROM_QUEUE_FROM_ISR( pxTransferStruct,
                            (USART_GetFlagStatus(USART2,USART_FLAG_TXE) == SET),
                            ( USART2->DR = ucChar), xHigherPriorityTaskWoken );
                    USART_ITConfig( USART1, USART_IT_TXE, DISABLE );
                }
#endif /* ioconfigUSE_UART_TX_CHAR_QUEUE */
                break;

                default :

                /* This must be an error.  Force an assert. */
                configASSERT( xHigherPriorityTaskWoken );
                break;
            }
        }
    }

    /* The ulReceived parameter is not used by the UART ISR. */
    ( void ) ulReceived;

    /* If lHigherPriorityTaskWoken is now equal to pdTRUE, then a context
     switch should be performed before the interrupt exists.  That ensures the
     unblocked (higher priority) task is returned to immediately. */
    portEND_SWITCHING_ISR( xHigherPriorityTaskWoken );
}
